app/views/hunts/_browse.html.erb

  <span class="title"><%=hunt.title%></span>
  <% unless hunt.pirate_hunts.exists?(:user_id => current_user.id)%>
---
SELECT  1 AS one FROM "pirate_hunts" WHERE "pirate_hunts"."hunt_id" = ? AND "pirate_hunts"."user_id" = ? LIMIT 1  [["hunt_id", 1], ["user_id", 1]]
SELECT "hunts".* FROM "hunts" WHERE (title LIKE '%shan%' OR user_id LIKE '%shan%' OR start_location LIKE '%shan%')  ORDER BY created_at DESC