app/views/pirate_tasks/show.html.erb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
---
		   <%=  @pirate_task.task.points %> Points <br>
		   <% unless @pirate_task.task.clue.blank? %>