app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @huntID = params[:hunt_id]
    if @task.save
---
INSERT INTO "tasks" ("points", "clue", "task_type", "correct_answer", "prompt", "hunt_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)