app/controllers/welcome_controller.rb

SELECT "hunts".* FROM "hunts" WHERE "hunts"."user_id" = ?  [["user_id", 1]]
SELECT "pirate_hunts".* FROM "pirate_hunts" WHERE "pirate_hunts"."user_id" = ?  [["user_id", 1]]
---
  def index
  	@created_hunts = Hunt.where(user_id: current_user.id)
  	@joined_hunts = PirateHunt.where(user_id: current_user.id)